[
  {
    "id": 1,
    "name": "CoinCogi",
    "description": "글로벌 가상자산 변동률 실시간 분석 서비스",
    "descriptionEn": "Real-time global cryptocurrency volatility analysis service",
    "demoUrl": "https://coincogi.com",
    "githubUrl": null,
    "gifUrl": "/coincogi.gif",
    "technologies": ["Python", "Django", "DRF", "Redis", "PostgreSQL", "Next.js"],
    "isMain": true,
    "projectType": "개인프로젝트",
    "projectTypeEn": "Personal Project",
    "detail": "CoinCogi는 암호화폐 실시간 급등 알림 플랫폼(SaaS)으로, 다수의 주요 거래소에서 가격을 지속적으로 모니터링하여 급등/급락 알림을 제공합니다.\n\n프로젝트 개요:\n암호화폐 시장의 급격한 변동성을 실시간으로 감지하고 사용자에게 즉시 알림을 제공하는 구독 기반 서비스입니다. 다중 거래소의 Futures/Spot 데이터를 통합하여 신뢰성 높은 알림 시스템을 구축했습니다.\n\n주요 기능:\n- 실시간 가격 모니터링: 다중 거래소 API를 통한 지속적인 데이터 수집 및 분석\n- 구독 플랜 시스템: 단계별 기능 분리를 통한 유연한 서비스 제공\n- 다중 거래소 통합: 각 거래소별 API 특성에 맞춘 데이터 수집 파이프라인 구축\n- 사용자 인증 및 권한 관리: JWT 기반 토큰 인증, 소셜 로그인, 이메일 인증 시스템\n- 커스터마이징: 사용자별 변동성 임계값 및 알림 민감도 설정 기능\n\n기술 스택:\n- 백엔드: Django, Django REST Framework, Gunicorn (WSGI 서버)\n- 데이터베이스: PostgreSQL (주 데이터 저장), Redis (캐싱 및 세션 관리)\n- 백그라운드 작업: Celery (비동기 작업 큐 시스템)\n- 프론트엔드: Next.js, React, TypeScript, Tailwind CSS\n- 인프라: Docker 컨테이너화, Nginx 리버스 프록시, AWS S3 파일 저장, Blue-Green 무중단 배포\n\n프로젝트 구성:\n백엔드는 Django REST Framework로 RESTful API를 제공하며, 거래소별 모니터링 스크립트는 독립적인 앱으로 분리했습니다. 프론트엔드는 Next.js의 App Router를 활용하여 서버 사이드 렌더링과 클라이언트 사이드 라우팅을 최적화했습니다. Celery를 통한 비동기 작업 처리로 실시간 알림 성능을 보장했습니다.\n\n문제 해결:\n- 대규모 트래픽 처리: Redis 캐싱과 데이터베이스 쿼리 최적화를 통해 동시 접속자 증가 시에도 안정적인 성능 유지\n- 실시간 데이터 동기화: 분산 락 메커니즘을 구현하여 다중 워커 환경에서 데이터 일관성 보장\n- API Rate Limiting: 거래소별 API 제한을 고려한 요청 스케줄링 및 재시도 로직 구현\n- 무중단 배포: Blue-Green 배포 전략을 통해 서비스 중단 없이 업데이트 가능하도록 인프라 구성",
    "detailEn": "CoinCogi is a real-time cryptocurrency surge alert platform (SaaS) that continuously monitors prices from multiple major exchanges and provides surge/drop alerts.\n\nProject Overview:\nA subscription-based service that detects rapid volatility in cryptocurrency markets in real-time and immediately notifies users. Built a reliable notification system by integrating Futures/Spot data from multiple exchanges.\n\nKey Features:\n- Real-time Price Monitoring: Continuous data collection and analysis through multiple exchange APIs\n- Subscription Plan System: Flexible service delivery through tiered feature separation\n- Multi-Exchange Integration: Data collection pipelines customized for each exchange's API characteristics\n- User Authentication & Authorization: JWT-based token authentication, social login, email verification system\n- Customization: User-specific volatility thresholds and notification sensitivity settings\n\nTech Stack:\n- Backend: Django, Django REST Framework, Gunicorn (WSGI server)\n- Database: PostgreSQL (primary data storage), Redis (caching and session management)\n- Background Jobs: Celery (asynchronous task queue system)\n- Frontend: Next.js, React, TypeScript, Tailwind CSS\n- Infrastructure: Docker containerization, Nginx reverse proxy, AWS S3 file storage, Blue-Green zero-downtime deployment\n\nProject Structure:\nThe backend provides RESTful APIs through Django REST Framework, with exchange-specific monitoring scripts separated into independent apps. The frontend utilizes Next.js App Router to optimize server-side rendering and client-side routing. Asynchronous task processing through Celery ensures real-time notification performance.\n\nProblem Solving:\n- Large-scale Traffic Handling: Maintained stable performance even with increased concurrent users through Redis caching and database query optimization\n- Real-time Data Synchronization: Implemented distributed lock mechanisms to ensure data consistency in multi-worker environments\n- API Rate Limiting: Implemented request scheduling and retry logic considering exchange-specific API limitations\n- Zero-downtime Deployment: Configured infrastructure with Blue-Green deployment strategy to enable updates without service interruption"
  },
  {
    "id": 2,
    "name": "CapitalFlow",
    "description": "글로벌 자본 이동 시각화 및 분석 시스템",
    "descriptionEn": "Global capital flow visualization and analysis system",
    "demoUrl": "https://capitalflow-frontend.onrender.com/",
    "githubUrl": "https://github.com/studioKjm/graduate",
    "gifUrl": "/capitalflow.gif",
    "technologies": ["Python", "Django", "React", "D3.js", "PostgreSQL"],
    "isMain": true,
    "projectType": "졸업작품(장려상)",
    "projectTypeEn": "Graduation Project (Encouragement Award)",
    "detail": "CapitalFlow는 전 세계 자본의 흐름을 시각적으로 탐색하고 시대별 자본 권력의 이동을 분석하는 오픈데이터 시각화 플랫폼입니다.\n\n프로젝트 개요:\nDjango REST Framework 백엔드와 Next.js 기반 프론트엔드를 통해 실시간 인터랙티브 맵 및 차트 시각화를 제공하는 웹 애플리케이션입니다. 전 세계 자본 흐름 데이터를 지도와 차트로 시각화하여 사용자가 직관적으로 이해할 수 있도록 설계했습니다.\n\n주요 기능:\n- 인터랙티브 세계 지도: 국가별 자본 총량을 색상 농도로 시각화하여 한눈에 파악 가능\n- 시간축 애니메이션: 장기간의 자본 흐름 변화를 애니메이션으로 재생하여 트렌드 분석\n- 다중 필터링: 연도, 분야, 자본 타입별 세밀한 데이터 필터링 기능\n- Flow Map 시각화: 국가 간 자본 이동 경로를 화살표로 표시하여 흐름 추적\n- 데이터 분석: 트렌드 분석, 순위, 인사이트 제공\n- 사용자 맞춤형 대시보드: 관심 분야 및 국가 즐겨찾기 기능\n\n기술 스택:\n- 백엔드: Django, Django REST Framework, PostgreSQL\n- 프론트엔드: Next.js, React, TypeScript, Tailwind CSS\n- 데이터 시각화: Deck.gl (대규모 데이터 렌더링), Mapbox GL JS (지도 렌더링), D3.js (차트 및 그래프)\n- 인프라: Docker, Docker Compose, Nginx, Redis, Celery\n\n프로젝트 구성:\n백엔드는 Django REST Framework로 RESTful API를 제공하며, 대용량 지리 데이터를 효율적으로 처리하기 위한 최적화된 쿼리 구조를 설계했습니다. 프론트엔드는 Next.js의 서버 사이드 렌더링을 활용하여 초기 로딩 성능을 개선했습니다. Deck.gl을 활용하여 수만 개의 데이터 포인트를 실시간으로 렌더링할 수 있는 고성능 시각화 시스템을 구축했습니다.\n\n문제 해결:\n- 대용량 데이터 렌더링: Deck.gl의 GPU 가속 렌더링을 활용하여 수만 개의 자본 흐름 경로를 부드럽게 표시\n- 지리 데이터 처리: 국가별 좌표 변환 및 지도 투영 최적화를 통해 정확한 위치 표시\n- 실시간 필터링 성능: Redis 캐싱과 데이터베이스 인덱싱을 통해 복잡한 필터 조합 시에도 빠른 응답 속도 보장\n- 사용자 인터랙션 최적화: 지도 확대/축소, 드래그 등 다양한 인터랙션에 대한 부드러운 애니메이션 처리",
    "detailEn": "CapitalFlow is an open data visualization platform that visually explores global capital flows and analyzes the movement of capital power across different eras.\n\nProject Overview:\nA web application that provides real-time interactive map and chart visualizations through a Django REST Framework backend and Next.js-based frontend. Designed to visualize global capital flow data through maps and charts for intuitive user understanding.\n\nKey Features:\n- Interactive World Map: Visualizes total capital by country through color intensity for quick understanding\n- Timeline Animation: Plays capital flow changes over long periods as animations for trend analysis\n- Multi-Filtering: Detailed data filtering by year, sector, and capital type\n- Flow Map Visualization: Displays capital movement paths between countries with arrows for flow tracking\n- Data Analysis: Provides trend analysis, rankings, and insights\n- Customized Dashboard: Favorite sectors and countries functionality\n\nTech Stack:\n- Backend: Django, Django REST Framework, PostgreSQL\n- Frontend: Next.js, React, TypeScript, Tailwind CSS\n- Data Visualization: Deck.gl (large-scale data rendering), Mapbox GL JS (map rendering), D3.js (charts and graphs)\n- Infrastructure: Docker, Docker Compose, Nginx, Redis, Celery\n\nProject Structure:\nThe backend provides RESTful APIs through Django REST Framework, with optimized query structures designed for efficient processing of large-scale geographic data. The frontend utilizes Next.js server-side rendering to improve initial loading performance. Built a high-performance visualization system using Deck.gl that can render tens of thousands of data points in real-time.\n\nProblem Solving:\n- Large-scale Data Rendering: Utilized Deck.gl's GPU-accelerated rendering to smoothly display tens of thousands of capital flow paths\n- Geographic Data Processing: Ensured accurate location display through country coordinate conversion and map projection optimization\n- Real-time Filtering Performance: Guaranteed fast response times even with complex filter combinations through Redis caching and database indexing\n- User Interaction Optimization: Handled smooth animations for various interactions such as map zoom, pan, and drag"
  },
  {
    "id": 3,
    "name": "Fitzy",
    "description": "MBTI 기반 AI 코디 추천 서비스",
    "descriptionEn": "MBTI-based AI outfit recommendation service",
    "demoUrl": null,
    "githubUrl": "https://github.com/studioKjm/Fitzy",
    "gifUrl": "/fitzy.gif",
    "technologies": ["Python", "Streamlit", "YOLO", "Fashion AI"],
    "isMain": true,
    "projectType": "팀프로젝트",
    "projectTypeEn": "Team Project",
    "detail": "Fitzy는 MBTI 성향을 기반으로 한 AI 코디 추천 서비스로, 컴퓨터 비전과 개인화 알고리즘을 결합하여 사용자에게 맞춤형 패션 추천을 제공합니다.\n\n프로젝트 개요:\n사용자의 MBTI 성향과 의류 이미지를 분석하여 개인화된 코디를 추천하는 AI 기반 웹 애플리케이션입니다. YOLO 객체 인식 모델을 활용하여 의류 아이템을 자동으로 분류하고, MBTI 특성에 맞는 스타일 매칭 알고리즘을 통해 추천 시스템을 구현했습니다.\n\n주요 기능:\n- 의류 객체 인식: YOLO 모델을 통한 실시간 의류 아이템 감지 및 분류\n- MBTI 기반 추천: 16가지 MBTI 유형별 특성에 맞춘 스타일 분석 및 코디 추천\n- 개인화 알고리즘: 사용자 선호도 학습을 통한 맞춤형 추천 시스템\n- 실시간 이미지 분석: 업로드된 의류 이미지의 즉시 처리 및 스타일 분석\n- 코디 조합 생성: 상의, 하의, 액세서리 등 다양한 아이템 조합 추천\n\n기술 스택:\n- AI/ML: YOLO (You Only Look Once) 객체 인식 모델, Fashion AI 알고리즘\n- 프레임워크: Streamlit (빠른 프로토타이핑 및 웹 인터페이스)\n- 언어: Python\n- 이미지 처리: OpenCV, PIL (Python Imaging Library)\n- 머신러닝: PyTorch 또는 TensorFlow (YOLO 모델 실행)\n\n프로젝트 구성:\n프로젝트는 크게 세 가지 모듈로 구성됩니다. 첫째, YOLO 모델을 활용한 의류 객체 인식 모듈로 이미지에서 의류 아이템을 감지하고 분류합니다. 둘째, MBTI 특성 분석 모듈로 사용자의 성향에 맞는 스타일을 매칭합니다. 셋째, Streamlit 기반 웹 인터페이스로 사용자와 상호작용하며 실시간으로 추천 결과를 제공합니다. 모델 학습 데이터는 패션 데이터셋을 활용하여 의류 분류 정확도를 향상시켰습니다.\n\n문제 해결:\n- 객체 인식 정확도: 다양한 각도와 조명 조건의 의류 이미지에 대응하기 위해 데이터 증강 기법 적용 및 모델 파인튜닝\n- 실시간 처리 성능: 이미지 전처리 최적화 및 모델 추론 속도 개선을 통해 빠른 응답 시간 확보\n- MBTI-스타일 매핑: 패션 전문가의 인사이트와 데이터 분석을 결합하여 신뢰성 높은 추천 알고리즘 설계\n- 사용자 경험 개선: Streamlit의 인터랙티브 컴포넌트를 활용하여 직관적이고 사용하기 쉬운 인터페이스 구현",
    "detailEn": "Fitzy is an AI outfit recommendation service based on MBTI personality types, combining computer vision and personalization algorithms to provide customized fashion recommendations.\n\nProject Overview:\nAn AI-based web application that recommends personalized outfits by analyzing users' MBTI traits and clothing images. Implemented a recommendation system by utilizing YOLO object recognition models to automatically classify clothing items and matching styles based on MBTI characteristics.\n\nKey Features:\n- Clothing Object Recognition: Real-time clothing item detection and classification through YOLO models\n- MBTI-based Recommendations: Style analysis and outfit recommendations tailored to 16 MBTI personality types\n- Personalization Algorithm: Customized recommendation system through user preference learning\n- Real-time Image Analysis: Immediate processing and style analysis of uploaded clothing images\n- Outfit Combination Generation: Recommendations for various item combinations including tops, bottoms, and accessories\n\nTech Stack:\n- AI/ML: YOLO (You Only Look Once) object recognition model, Fashion AI algorithms\n- Framework: Streamlit (rapid prototyping and web interface)\n- Language: Python\n- Image Processing: OpenCV, PIL (Python Imaging Library)\n- Machine Learning: PyTorch or TensorFlow (YOLO model execution)\n\nProject Structure:\nThe project consists of three main modules. First, a clothing object recognition module using YOLO models to detect and classify clothing items from images. Second, an MBTI trait analysis module that matches styles according to user characteristics. Third, a Streamlit-based web interface that interacts with users and provides real-time recommendation results. Model training utilized fashion datasets to improve clothing classification accuracy.\n\nProblem Solving:\n- Object Recognition Accuracy: Applied data augmentation techniques and model fine-tuning to handle clothing images from various angles and lighting conditions\n- Real-time Processing Performance: Secured fast response times through image preprocessing optimization and model inference speed improvements\n- MBTI-Style Mapping: Designed a reliable recommendation algorithm by combining fashion expert insights with data analysis\n- User Experience Improvement: Implemented an intuitive and user-friendly interface utilizing Streamlit's interactive components"
  }
]

